Картриджи/src/Documents/ПриемПередачаКартриджей/ПриемПередачаКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемПередачаКартриджей</name>
  <basedOn>Document.СпросНаКартриджи</basedOn>
  <registerRecords>InformationRegister.ИсторияПередчаиКартриджей</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиКартриджей</registerRecords>
  <attributes>
    <name>ОснПодразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовПодразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СпросНаКартриджи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Передача</name>
    <attributes>
      <name>Картридж</name>
      <type>
        <types>CatalogRef.МоделиКартриджей</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Картриджи/src/AccumulationRegisters/ОстаткиКартриджей/ОстаткиКартриджей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиКартриджей</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Картридж</name>
    <type>
      <types>CatalogRef.МоделиКартриджей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Картриджи/src/Documents/ПриемПередачаКартриджей/Forms/ФормаПоискаПоИнвентарномуНомеру/Module.bsl
&НаСервере
Процедура ЗапонитьТаблицу(Текст)

	Картриджи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Картриджи.Ссылка
		|ПОМЕСТИТЬ ВТ_Картриджи
		|ИЗ
		|	Справочник.Картриджи КАК Картриджи
		|ГДЕ
		|	Картриджи.ИнвентаризационныйНомер ПОДОБНО &ИнвентаризационныйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиКартриджейОстатки.Картридж,
		|	ОстаткиКартриджейОстатки.Подразделения,
		|	ОстаткиКартриджейОстатки.КоличествоОстаток,
		|	ОстаткиКартриджейОстатки.Подразделения.Принтер,
		|	ОстаткиКартриджейОстатки.Картридж.ИнвентаризационныйНомер КАК ИнвентаризационныйНомер
		|ПОМЕСТИТЬ ТЧВ
		|ИЗ
		|	РегистрНакопления.ОстаткиКартриджей.Остатки(
		|			,
		|			Картридж В
		|				(ВЫБРАТЬ
		|					ВТ_Картриджи.Ссылка
		|				ИЗ
		|					ВТ_Картриджи КАК ВТ_Картриджи)) КАК ОстаткиКартриджейОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧВ.Картридж,
		|	ТЧВ.Подразделения,
		|	ТЧВ.ПодразделенияПринтер КАК Принтер,
		|	ТЧВ.ИнвентаризационныйНомер,
		|	ТЧВ.КоличествоОстаток
		|ПОМЕСТИТЬ ТЧД
		|ИЗ
		|	ТЧВ КАК ТЧВ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧВ.Картридж,
		|	ТЧВ.Подразделения,
		|	ТЧВ.ПодразделенияПринтер,
		|	ТЧВ.ИнвентаризационныйНомер,
		|	ТЧВ.КоличествоОстаток
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧД.Картридж,
		|	ТЧД.Подразделения,
		|	ТЧД.Принтер,
		|	ТЧД.ИнвентаризационныйНомер
		|ИЗ
		|	ТЧД КАК ТЧД";

	Запрос.УстановитьПараметр("ИнвентаризационныйНомер", "%"+Текст+"%");

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	НомерСтроки = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		НоваяСтрока = Картриджи.Добавить();
		НоваяСтрока.Картридж         =  ВыборкаДетальныеЗаписи.Картридж;
		НоваяСтрока.Подразделение    =  ВыборкаДетальныеЗаписи.Подразделения;
		НоваяСтрока.НомерСтроки      =  НомерСтроки;
		НоваяСтрока.ИнвентарныйНомер =  ВыборкаДетальныеЗаписи.ИнвентаризационныйНомер;
		НоваяСтрока.Статус           =  ВыборкаДетальныеЗаписи.Статус;
		
	КонецЦикла;
	

КонецПроцедуры // 


&НаКлиенте
Процедура Выбрать(Команда)

	ТекущиеДанные = Элементы.Картриджи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Закрыть(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура КартриджиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
    СтандартнаяОбработка = Ложь;	
	
	Выбрать(0);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентарныйНомерПриИзменении(Элемент)
	
	ЗапонитьТаблицу(Элемент.ТекстРедактирования);
	
	Если Картриджи.Количество() = 1 Тогда
		Закрыть(Картриджи[0]);
	КонецЕсли;
	
КонецПроцедуры
